controllers/ComplainantController.php

INSERT INTO `complainant` (`name`, `dob`, `gid`, `address`, `mail`, `contact`, `sid`, `place`, `cid`, `description`, `aid`) VALUES ('hg', '1996-08-09', 1, 'fg', 'ff', 567, 1, 'f', 17, 'vfd', 0)
---
    public function actionCreate()
    {
        $model = new Complainant();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

UPDATE `complainant` SET `aid`=2 WHERE `id`=4
---
public function actionTrack()
    {

      $model= new complainant();
       if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `complainant` WHERE `id`='4'
---
    protected function findModel($id)
    {
        if (($model = Complainant::findOne($id)) !== null) {