views/complainant/_form.php

SELECT * FROM `gender`
---
    ?>
    <?= $form->field($model, 'dob')->textInput() ?>

     <?= $form->field($model, 'gid')->radioList(ArrayHelper::map(\app\models\Gender::find()->all(),'gid','gname')); ?>

SELECT * FROM `stations`
SELECT * FROM `complaints`
---

    <?= $form->field($model, 'contact')->textInput() ?>

    <?= $form->field($model, 'sid')->dropDownList(ArrayHelper::map(Stations::find()->all(),'sid','sname')); ?>

    <?= $form->field($model, 'place')->textInput(['maxlength' => true]) ?>

    <?= $form->field($model, 'cid')->dropDownList(ArrayHelper::map(Complaints::find()->all(),'cid','cname')) ?>